CSI API ETABS v1
cDStEurocode_3_2005 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDStEurocode_3_2005
Public Interface cDStEurocode_3_2005
Dim instance As cDStEurocode_3_2005
public interface class cDStEurocode_3_2005
type cDStEurocode_3_2005 =  interface end
The cDStEurocode_3_2005 type exposes the following members.
Methods
Name | Description
GetOverwrite
 DEPRECATED ; refer to GetOverwrite(String, Int32, Double, Boolean)
GetPreference
 DEPRECATED ; refer to GetPreference(Int32, Double)
SetOverwrite
 DEPRECATED ; refer to SetOverwrite(String, Int32, Double, eItemType)
SetPreference
 DEPRECATED ; refer to SetPreference(Int32, Double)
Top
See Also
Reference
ETABSv1 Namespace